Merge pull request #7 from Ron-Zehavi/feature/aws-apprunner-infra
Add AWS App Runner infrastructure
